[Rainmeter]
Update=1000
AccurateText=0
DynamicWindowSize=0
Group=PRTSkin | PRTSkinHidable | PRTSkinTerminal

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|作战终端，如果你的作战策略需要好天气的话。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#@#GlobalVars.inc
@Include2=#@#Includes\Terminal.inc
@Include3=#@#Includes\mWeatherParser.inc


[TerminalM1]


; 10:10 A.M. 天气/晴
[Terminal]
LeftMouseUpAction=#RelsAct##WeatherTerminalAction#

[TerminalDots]

[TerminalIconDrop]
ImageName=#WeatherTerminalIcon#
Hidden=#WeatherTerminalHideIconBackdrop#

[Terminal.Bk]

[TerminalIcon]
ImageName=#WeatherTerminalIcon#

[TerminalTitle]
Text=#WeatherTerminalTitle#

; 当前状态
[TerminalStateBg]

[TerminalState]
Text=#WeatherTerminalState#

[TerminalNow]
Text=[mCurrentPhrase]
DynamicVariables=1


; 理智指示器
; 失去理智.png
[TerminalSanBg]

[TerminalSanMax]
Text=[mCurrentTemperatureMin]/[mCurrentTemperatureMax]
X=-12R
DynamicVariables=1

[TerminalSanLabel]
Text=#WeatherTerminalSanLabel#

[TerminalSanIcon]
Meter=String
AntiAlias=1
FontFace=JDWI
FontColor=#SecondaryFGColor#
FontSize=90
InlineSetting=Shadow | 0 | 0 | 3 | 0,0,0,180
Text=[mCurrentIcon]
X=([TerminalSanBg:X]-4)
Y=([TerminalSanBg:Y]+10)
DynamicVariables=1

[TerminalSanAddBg]

[TerminalSanAddIcon]

[TerminalSan]
Text=[mCurrentTemperature]
X=([TerminalSanBg:XW]+14)
DynamicVariables=1


; 他戴上了遮罩。
[TerminalMask]


; 装饰线
[TerminalDecoLine]